export const allowedTransportation: string[] = [
  'Гроші. Без заповнення декларації до 10000 євро. на одну людину.',
  'Продукти харчування. Дитяче харчування до 2 кг., риба та морепродукти до 2 кг., по 5 кг, свіжих овочів та фруктів.',
  'Техніка. Дозволено завозити техніку для особистого використання (ноутбук, фотоапарат, мобільний телефон).',
  'Алкоголь. До 1-го літра міцних алкогольних напоїв (22% і більше).',
  'Тютюн. 2 пачки сигарет (40 шт) або 50 г тютюну для куріння або 10 сигар або 10 мілілітрів рідини для електронних сигарет.',
  'Ліки. Стандартний набір ліків.',
]

export const disallowedTransportation: string[] = [
  'Наркотики та психотропні речовини.',
  'Зброя, вибухові речовини, хімічні та токсичні продукти.',
  'Тварини та рослини з "Червоної книги".',
  'Колекційні матеріали (картини, монети, марки тощо) без дозвільних документів.',
  'Товари, які порушують права інтелектуальної власності.',
  `М'ясо, масло(олія), сало.`,
]

type T_TransportationDescriptionMain = {
  mainLabel: string
  mainSub: string
}

type T_TransportationDescriptionSecondary = {
  secondaryLabel: string
  secondarySub: string[] | null
}

interface I_TransportationDescription {
  main: T_TransportationDescriptionMain
  secondary: T_TransportationDescriptionSecondary[]
}

export const transportationDescription: I_TransportationDescription = {
  main: {
    mainLabel: 'Зелений коридор',
    mainSub: `"Зелений коридор" призначений для громадян, які переміщують через митний кордон України товари в обсягах, що не підлягають оподаткуванню митними платежами та не підпадають під встановлені законодавством заборони чи обмеження на їх ввезення чи вивезення. Проходження цим коридором звільняє громадян від заповнення митної декларації.
    "Зелений коридор" громадяни мають право обрати у випадках, якщо вони переміщають:`,
  },
  secondary: [
    {
      secondaryLabel: '1. Особисті речі:',
      secondarySub: [
        `два мобільні телефони, одна відеокамера, один фотоапарат, два переносні персональні комп'ютери;`,
        `Спортивне спорядження;`,
        `Особисті прикраси, які були в користуванні;`,
        `одяг, взуття, призначені виключно для власного користування;`,
        `500 мл туалетної води та/або 100 мл парфумів;`,
        `Інші товари для особистого користування.`,
      ],
    },
    {
      secondaryLabel:
        '2. Товари, загальна вартість яких не перевищує 500 євро, а вага 50 кг (наземним транспортом) та 1000 євро (повітряним).',
      secondarySub: null,
    },
    {
      secondaryLabel: `3. Готівкову валюту України чи іноземну валюту
        у сумі, яка не перевищує 10 000 євро (в еквіваленті) на одну особу.`,
      secondarySub: null,
    },
    {
      secondaryLabel: `4. Алкогольні напої: горілчані вироби (горілка, коньяк, віскі та ін.) у кількості 1 л, вино – 2 л, пиво – 5 л;`,
      secondarySub: null,
    },
    {
      secondaryLabel: `5. Тютюнові вироби - 3 пачки сигарет або 50 сигар або 250 г тютюну (або 250 г цих виробів).`,
      secondarySub: null,
    },
    {
      secondaryLabel: `6. Продукти для споживання у сумі,
      що не перевищує 200 євро:`,
      secondarySub: [
        'в упаковці виробника (призначеної для роздрібної торгівлі) – 1 упаковка або загальною масою не більше 2 кг кожного найменування;',
        'без упаковки – до 2 кг кожного найменування;',
        'Неподільний продукт, готовий до безпосереднього вживання - 1 шт. кожного найменування.',
      ],
    },
    {
      secondaryLabel: `7. Лікарські засоби у кількості, що не перевищує 5 упаковок кожного найменування на одну особу (крім містять наркотичні або психотропні речовини) або не перевищує зазначену в рецепті (є в особи), виданому на ім'я цієї особи та завіреному печаткою лікаря та/або закладу охорони здоров'я .`,
      secondarySub: null,
    },
  ],
}
